spec/cassettes/StripeWrapper/StripeWrapper_Charge/with_invalid_card/does_not_charge_the_card_successfully.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=12&card[exp_year]=2016&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.1
      Authorization:
      - Bearer sk_test_g9KW02Qtqasrw6Iu9Vj59gMm
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.1","lang":"ruby","lang_version":"2.1.5 p273 (2014-11-13)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        kafai-Lenovo-B480 3.13.0-43-generic #72-Ubuntu SMP Mon Dec 8 19:35:06 UTC
        2014 x86_64 x86_64 x86_64 GNU/Linux"}'
      Content-Length:
      - '82'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2014 04:58:00 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '711'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_C1RRLvnnaXcOwQZz
      Stripe-Version:
      - '2014-12-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_15DThECP7OfzzeMeLJU5QATE",
          "livemode": false,
          "created": 1419483480,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_15DThECP7OfzzeMe9YuBiUyb",
            "object": "card",
            "last4": "0002",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 12,
            "exp_year": 2016,
            "fingerprint": "qxp6OysZJwyIAwtS",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": null,
            "address_line1_check": null,
            "address_zip_check": null,
            "dynamic_last4": null,
            "customer": null
          }
        }
    http_version: 
  recorded_at: Thu, 25 Dec 2014 04:58:00 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=300&currency=usd&card=tok_15DThECP7OfzzeMeLJU5QATE&description=test%20for%20stripe%20wrapper
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.1
      Authorization:
      - Bearer sk_test_g9KW02Qtqasrw6Iu9Vj59gMm
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.1","lang":"ruby","lang_version":"2.1.5 p273 (2014-11-13)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        kafai-Lenovo-B480 3.13.0-43-generic #72-Ubuntu SMP Mon Dec 8 19:35:06 UTC
        2014 x86_64 x86_64 x86_64 GNU/Linux"}'
      Content-Length:
      - '99'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2014 04:58:01 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '162'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_OT372BMopNhcRgg1
      Stripe-Version:
      - '2014-12-17'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_15DThFCP7OfzzeMewTMbNzhz"
          }
        }
    http_version: 
  recorded_at: Thu, 25 Dec 2014 04:58:01 GMT
recorded_with: VCR 2.9.2
